docs/api/cfd/cases/kleefsman_impact/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

// SPHERIC Test 2 / Kleefsman et al. (2005) MARIN dam-break-with-obstacle.
scale 1;
vertices
(
    (0 0 0) (3.22 0 0) (3.22 1 0) (0 1 0)
    (0 0 1) (3.22 0 1) (3.22 1 1) (0 1 1)
);
blocks ( hex (0 1 2 3 4 5 6 7) (161 50 50) simpleGrading (1 1 1) );
edges ();
boundary
(
    stationaryWalls
    {
        type wall;
        faces ( (0 3 2 1) (2 6 5 1) (1 5 4 0) (3 7 6 2) (0 4 7 3) );
    }
    atmosphere { type patch; faces ( (4 5 6 7) ); }
    obstacle { type wall; faces (); }
);
mergePatchPairs ();
