docs/api/cfd/cases/kleefsman_impact/constant/turbulenceProperties
FoamFile { version 2.0; format ascii; class dictionary; object turbulenceProperties; }

simulationType  laminar;
